import os
if __name__ == '__main__':
    # citys0 = ['香港','澳门','广州','深圳','珠海','佛山','中山','东莞','肇庆','江门','惠州']
    # citys1 = ['上海市','南京','无锡','常州','苏州','南通','扬州','镇江','盐城','泰州','杭州','宁波','温州','湖州','嘉兴','绍兴','金华','舟山','台州','合肥','芜湖','马鞍山','铜陵','安庆','滁州','池州','宣城']
    # citys2 = ['北京','天津','石家庄','唐山','保定','秦皇岛','廊坊','沧州','承德','张家口']
    # group = ['粤港澳大湾区城市', '长三角城市群城市', '京津冀城市群城市']
    # # group = ['粤港澳大湾区城市', '长三角城市群城市', '京津冀城市群城市']
    # # # ['香港','澳门','广州','深圳','珠海','佛山','中山','东莞','肇庆','江门','惠州']
    # # city = [['香港','澳门','广州','深圳','珠海','佛山','中山','东莞','肇庆','江门','惠州'],
    # #         ['上海市','南京','无锡','常州','苏州','南通','扬州','镇江','盐城','泰州','杭州','宁波','温州','湖州','嘉兴','绍兴','金华','舟山','台州','合肥','芜湖','马鞍山','铜陵','安庆','滁州','池州','宣城'],
    # #         ['北京','天津','石家庄','唐山','保定','秦皇岛','廊坊','沧州','承德','张家口']]
    # # group = ['长三角城市群城市', '粤港澳大湾区城市', '京津冀城市群城市']
    # # city = [['无锡','常州','苏州','南通','扬州','镇江','盐城','泰州','杭州','宁波','温州','湖州','嘉兴','绍兴','金华','舟山','台州','合肥','芜湖','马鞍山','铜陵','安庆','滁州','池州','宣城'],
    # #         ['香港','澳门','广州','深圳','珠海','佛山','中山','东莞','肇庆','江门','惠州'],
    # #         ['北京','天津','石家庄','唐山','保定','秦皇岛','廊坊','沧州','承德','张家口']]
    # for item in citys0:
    #     path = './'+group[0]+'/'+item
    #     print(path)
    #     os.makedirs(path)
    # for item in citys1:
    #     path = './'+group[1]+'/'+item
    #     print(path)
    #     os.makedirs(path)
    # for item in citys2:
    #     path = './'+group[2]+'/'+item
    #     print(path)
    #     os.makedirs(path)
    # print(str(1+1))
